# Taps
tap 'homebrew/cask'

# Binaries
brew 'fish'
brew 'bash' # Install a modern version of Bash.
brew 'git'
brew 'bat'
brew 'git-delta'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'grc'
brew 'ripgrep'
brew 'tree'
brew 'gnupg' # Install GnuPG to enable PGP-signing commits.
brew 'vim'
brew 'starship'

# Applications
cask 'iterm2'
cask 'visual-studio-code'
cask 'google-chrome'
cask 'docker'
cask 'raycast'